bench/m0-redux/results/mtp-k1/code-c8-greedy-thinkoff.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x70fe509a49a0>, trust_remote_code=False, seed=8, num_prompts=160, dataset_name='hf', no_stream=False, dataset_path='likaixin/InstructCoder', no_oversample=False, skip_chat_template=True, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=512, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=8, model='nvidia/Qwen3.8-27B-NVFP4', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=4, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['config=mtp-k1', 'cell=code', 'sampling=greedy', 'thinking=off', 'max_model_len=262144'], result_dir='/workspace/m0-redux/results/mtp-k1', result_filename='code-c8-greedy-thinkoff.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-ed70320b-', top_p=None, top_k=None, min_p=None, temperature=0.0, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body={'chat_template_kwargs': {'enable_thinking': False}}, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 4 requests...
100%|██████████| 4/4 [00:02<00:00,  1.57it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 8
100%|██████████| 160/160 [01:02<00:00,  2.57it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     160       
Failed requests:                         0         
Maximum request concurrency:             8         
Benchmark duration (s):                  62.20     
Total input tokens:                      26016     
Total generated tokens:                  29749     
Request throughput (req/s):              2.57      
Output token throughput (tok/s):         478.30    
Peak output token throughput (tok/s):    377.00    
Peak concurrent requests:                12.00     
Total token throughput (tok/s):          896.58    
---------------Time to First Token----------------
Mean TTFT (ms):                          232.17    
Median TTFT (ms):                        209.25    
P50 TTFT (ms):                           209.25    
P90 TTFT (ms):                           353.32    
P99 TTFT (ms):                           371.80    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          15.31     
Median TPOT (ms):                        15.18     
P50 TPOT (ms):                           15.18     
P90 TPOT (ms):                           18.10     
P99 TPOT (ms):                           22.14     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.17     
Median ITL (ms):                         19.86     
P50 ITL (ms):                            19.86     
P90 ITL (ms):                            20.32     
P99 ITL (ms):                            188.69    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          3015.58   
Median E2EL (ms):                        2389.05   
P50 E2EL (ms):                           2389.05   
P90 E2EL (ms):                           6244.87   
P99 E2EL (ms):                           8613.83   
---------------Speculative Decoding---------------
Acceptance rate (%):                     97.49     
Acceptance length:                       1.97      
Drafts:                                  15023     
Draft tokens:                            15023     
Accepted tokens:                         14646     
Per-position acceptance (%):
  Position 0:                            97.49     
==================================================